# CannotGenerateFaces Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..CannotGenerateFaces Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Couldn't generate surfaces for stairs.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotGenerateFaces { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotGenerateFaces As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotGenerateFaces {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace